Revit 2026 API

# ExportLinetypeKey Properties

---

The ExportLinetypeKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalLinetypeName | The original linetype name. |

#### Reference

ExportLinetypeKey Class

Autodesk.Revit.DB Namespace